#!/bin/bash
# DVA CLI - Developer Workflow Automation
# MIT License (c) 2025 Nizam Uddin Shamrat


#*
#* ╔══════════════════════════════════════════════════════════════════════════════════════════════════╗
#* ║                                   💰 Imported Files                                              ║
#* ╚══════════════════════════════════════════════════════════════════════════════════════════════════╝
#*


DVA_HOME="$HOME/.dva"

# Import helpers
source "$DVA_HOME/scripts/logger.sh"
source "$DVA_HOME/scripts/ui.sh"
source "$DVA_HOME/scripts/components/main_menu_ui.sh"
source "$DVA_HOME/scripts/tasks/note_task.sh"
source "$DVA_HOME/scripts/dva_cli.sh"

clear

#*
#* ┏==================================================================================================┓
#* ┃                                   📖 CLI Starting Point                                          ┃
#* ┗==================================================================================================┛
#*


    load_main_screen

