#!/bin/bash

#*
#* ╔══════════════════════════════════════════════════════════════════════════════════════════════════╗
#* ║                                   💰 Imported Files                                              ║
#* ╚══════════════════════════════════════════════════════════════════════════════════════════════════╝
#*

source "$DVA_HOME/scripts/presentation/screens/main_welcome.sh"
source "$DVA_HOME/scripts/presentation/screens/flutter_screen.sh"
source "$DVA_HOME/scripts/utils/text_printer.sh"

#*
#* ┏==================================================================================================┓
#* ┃                                   📖 Drawing Main Screen                                         ┃
#* ┗==================================================================================================┛
#*



 function load_main_screen(){
   
   
   #*
   #* ✌️ Welcome User
   #*
   
  print_welcome_message

  printMainMenuUi

  flutter_screen

 }


